# Focused macOS toolchain for local coding agents. Project runtimes stay project-owned.
brew "bash"
brew "bats-core"
brew "coreutils"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "grep"
brew "jq"
brew "make"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
cask "1password-cli"
